Revit 2024 API
BuiltInFailures.StairRampFailures.StairsRunRunJoinNotAllowedFailure Property
 Run-Run join is not allowed of they have same "Start With Riser"/"End With Riser" configuration at the joined end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsRunRunJoinNotAllowedFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsRunRunJoinNotAllowedFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsRunRunJoinNotAllowedFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace